#include <iostream>
using namespace std;

int main()
{
	/*int a;
	cin >> a;
	if (a > 0) {
		a += 1;
  }
	else {
		a -= 1;
}
	cout << a << endl;
	*/
	//If2.Дано целое число.Если оно является положительным, то прибавить к
	//нему 1; в противном случае вычесть из него 2. Вывести полученное число.
	/*int a;
cin >> a;
if (a > 0) { 
	a += 1;
}
else {
	a -= 2;
}
cout << a << endl;*/
	//If3.Дано целое число.Если оно является положительным, то прибавить к
		//нему 1; если отрицательным, то вычесть из него 2; если нулевым, то
		//заменить его на 10. Вывести полученное число.
	/*int a;
	cin >> a;
	if (a > 0) {
		a += 1;
	} 
	else {
		if (a < 0) {
			a -= 2;
		}
		else {
			a = 10;
		}
	}
	cout << a << endl;*/
	//If4◦
		//.Даны три целых числа.Найти количество положительных чисел в исходном наборе.
	/*int a, b, c, n;
	cin >> a >> b >> c;
	n = 0;
	if (a > 0) {
		n += 1;
	}
	if (b > 0) {
		n += 1;
	}
	if (c > 0) {
		n += 1;
	} cout << n << endl;*/
	//If5.Даны три целых числа.Найти количество положительных и количество
		//отрицательных чисел в исходном наборе
	/*int a, b, c, n, d;
	cin >> a >> b >> c;
	n = 0;
	d = 0;
	if (a > 0) {
		n += 1;
	}
	else {
		d += 1;
	}
	if (b > 0) {
		n += 1;
	}
	else {
		d += 1;
	}
	if (c > 0) {
		n += 1;
	}
	else {
		d += 1;
	}cout << n << endl;
	cout << d << endl;*/
	//If6◦
		//.Даны два числа.Вывести большее из них.
	/*int a, b;
	cin >> a >> b;
	if (a > b) {
		cout << a << endl;
	}
	else {
		cout << b << endl;
	}*/
	//If7.Даны два числа.Вывести порядковый номер меньшего из них.
	/*int a, b;
	cin >> a >> b;
	if (a < b) {
		cout << a << endl;
	}
	else {
		cout << b << endl;
	}*/
	//If8◦
		//.Даны два числа.Вывести вначале большее, а затем меньшее из них.
	/*int a, b;
	cin >> a >> b;
	if (a < b) {
		cout << b << endl;
		cout << a << endl;
	}
	else {
		cout << a << endl;
		cout << b << endl;
	}*/
//If9.Даны две переменные вещественного типа : A, B.Перераспределить значения данных переменных так, чтобы в A оказалось меньшее из значений,
//а в B — большее.Вывести новые значения переменных A и B.
/*int a, b, c;
cin >> a >> b;
if (a < b) {
	cout << a;
	cout << b;
}
else {
	c = a;
	a = b;
	b = c;
	cout << a;
	cout << b;
}*/


	
	
	
	
	
	
	return 0;
}
